In [1]:
import pandas as pd
from matplotlib import pyplot as plt
from datetime import datetime
import seaborn as sns

%matplotlib inline

In [2]:
rankings = pd.read_csv('./data/atp_rankings_current.csv', names=["date","rank","player_id","rank_points"])
players = pd.read_csv('./data/atp_players.csv', names=["player_id","first_name","last_name","hand","birth_date","country"])

In [3]:
rankings.head()

       date  rank  player_id  rank_points
0  20210104     1     104925        12030
1  20210104     2     104745         9850
2  20210104     3     106233         9125
3  20210104     4     106421         8470
4  20210104     5     103819         6630

In [4]:
rankings.date.value_counts()

20210111    2006
20210104    2005
Name: date, dtype: int64

In [5]:
mask = rankings.date.isin(['20210111'])
curr_rankings = rankings[mask]

In [6]:
curr_rankings.head()

          date  rank  player_id  rank_points
2005  20210111     1     104925        12030
2006  20210111     2     104745         9850
2007  20210111     3     106233         9125
2008  20210111     4     106421         8470
2009  20210111     5     103819         6630

In [7]:
players.head()

   player_id      first_name last_name hand  birth_date country
0     100001         Gardnar    Mulloy    R  19131122.0     USA
1     100002          Pancho    Segura    R  19210620.0     ECU
2     100003           Frank   Sedgman    R  19271002.0     AUS
3     100004        Giuseppe     Merlo    R  19271011.0     ITA
4     100005  Richard Pancho  Gonzales    R  19280509.0     USA

In [8]:
players["name"] = players["first_name"] + " " + players["last_name"]

In [9]:
players.head()

,player_id,first_name,last_name,hand,birth_date,country,name
0,100001,Gardnar,Mulloy,R,19131122.0,USA,Gardnar Mulloy
1,100002,Pancho,Segura,R,19210620.0,ECU,Pancho Segura
2,100003,Frank,Sedgman,R,19271002.0,AUS,Frank Sedgman
3,100004,Giuseppe,Merlo,R,19271011.0,ITA,Giuseppe Merlo
4,100005,Richard Pancho,Gonzales,R,19280509.0,USA,Richard Pancho Gonzales

In [12]:
curr_rankings.shape

(2006, 4)

In [13]:
players.shape

(54985, 7)

In [14]:
#joining the two tables 

final_rank = curr_rankings.merge(players, how='inner', on=["player_id"])

In [15]:
final_rank.head()

,date,rank,player_id,rank_points,first_name,last_name,hand,birth_date,country,name
0,20210111,1,104925,12030,Novak,Djokovic,R,19870522.0,SRB,Novak Djokovic
1,20210111,2,104745,9850,Rafael,Nadal,L,19860603.0,ESP,Rafael Nadal
2,20210111,3,106233,9125,Dominic,Thiem,R,19930903.0,AUT,Dominic Thiem
3,20210111,4,106421,8470,Daniil,Medvedev,R,19960211.0,RUS,Daniil Medvedev
4,20210111,5,103819,6630,Roger,Federer,R,19810808.0,SUI,Roger Federer

In [16]:
final_rank.drop(['date','first_name','last_name','hand','birth_date','country'], axis=1, inplace=True)

In [17]:
final_rank.head()

   rank  player_id  rank_points             name
0     1     104925        12030   Novak Djokovic
1     2     104745         9850     Rafael Nadal
2     3     106233         9125    Dominic Thiem
3     4     106421         8470  Daniil Medvedev
4     5     103819         6630    Roger Federer